Revit 2027 API
FabricationPartSizeMap.MappedServiceId Property
 The mapped service identifier of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MappedServiceId { get; set; }
Public Property MappedServiceId As Integer
	Get
	Set
public:
property int MappedServiceId {
	int get ();
	void set (int value);
}
member MappedServiceId : int with get, set
Property Value
Int32
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace